---
kind: property
id: P:Autodesk.Revit.ApplicationServices.ControlledApplication.Cities
source: html/3a868628-038c-df32-df1b-2a6a55404c27.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.Cities Property

Returns a set of all the known city locations within Revit.

## Syntax (C#)
```csharp
public CitySet Cities { get; }
```

## Remarks
Each city has information about longitude, latitude etc.